
// создать переменные товаров с ценами 15.678, 123.965, 90.2345   //
// посчитать минимум, максимум                                    //
// посчитать сумму товаров                                        //
// округлить сумму товаров                                        //
// проверить является сумма товаров четным или нечетным числом    //
// вычислить сдачу если у тебя есть 500 грн                       //
// посчитать среднюю стоимость товаров
// сгенерировать случайную скидку от 0 - 100 %
// посчитать сумму к оплате со скидкой
// 10. посчитать сколько ты сэкономила

// вывести все результаты по пунктам в консоль или в дом дерево
// console.log() / document.writeln




// --------------------------------------1----------------------------------------

let car = 15.678
let banana = 123.965
let cup = 90.2345


// ---------------------------------------2----------------------------------------

let max = Math.max(car, banana, cup)
let min = Math.min(car, banana, cup)

// ---------------------------------------3----------------------------------------

let sum = car + banana + cup

// ---------------------------------------4---------------------------------------

let sumFloor = Math.ceil(sum)

// ---------------------------------------5----------------------------------------

let fn = () => {
    if (sumFloor % 2) {
        console.log("5 sumFloor --- nechetnii ")
    } else {
        console.log("5 sumFloor --- chetnii ")
    }
}

// ---------------------------------------6----------------------------------------

let myCash = 500
let result = myCash - car - banana - cup

// ---------------------------------------7----------------------------------------

let middleCosts = sum / 3

// ---------------------------------------8----------------------------------------

let discount = Math.random().toFixed(2) * 100

// ---------------------------------------9----------------------------------------

let discountPrice = (sum - sum * (discount / 100)).toFixed(2)

// ---------------------------------------10----------------------------------------

let saved = (sum * (discount / 100)).toFixed(2)

// ---------------------------------------------------------------------------------




console.log(" Lesson 1 ")

console.log(" 1 car : ", car, " banana : ", banana, " cup : ", cup)
document.write(" 1 car : ", car, " banana : ", banana, " cup : ", cup)

console.log(" 2 max : ", max, "  min : ", min)
console.log(" 1 min : ", min)

console.log(" 3 sum : ", sum)

console.log(" 4 sumFloor : ", sumFloor)

console.log(" 5 fn : ", fn())

console.log(" 6 result : ", result.toFixed(2))

console.log(" 7 middleCosts : ", middleCosts.toFixed(2))

console.log(" 8 discount : ", discount, "%")

console.log(" 9 discountPrice : ", discountPrice)

console.log(" 10 saved : ", saved)










